app/Controllers/LoginController.php

SELECT *
FROM `member`
WHERE `email` = 'kevin@gmail.com'
 LIMIT 1
---
    public function login()
    {
        // Inisialisasi kedua model
        $modelMember = new MemberModel();
        $modelToken = new MemberTokenModel();

        // Ambil data JSON dari body request
        $data = $this->request->getJSON();

        // Validasi input
        if (!isset($data->email) || !isset($data->password)) {
            return $this->failResponse("Email dan password diperlukan", 400);
        }

        // 1. Cari user berdasarkan email
        $user = $modelMember->where('email', $data->email)->first();