app/Controllers/ProdukController.php

    public function create()
    {
        $data = $this->request->getJSON();

        // Validasi sederhana
        if (!isset($data->kode_produk) || !isset($data->nama_produk) || !isset($data->harga)) {
            return $this->failResponse("Data tidak lengkap", 400);
        }

        try {
            // $this->model->insert() akan mengembalikan ID baru jika sukses
            $newId = $this->model->insert((array) $data);
---
INSERT INTO `produk` (`kode_produk`, `nama_produk`, `harga`) VALUES ('09', 'Pensil', 5000)