app/Controllers/RegistrasiController.php

SELECT *
FROM `member`
WHERE `email` = 'budi@santoso.com'
 LIMIT 1
INSERT INTO `member` (`nama`, `email`, `password`) VALUES ('Budi Santoso', 'budi@santoso.com', '$2y$10$wpStRfsszIDxcjUgibIV2eE6uuzgKRalY7I7NaY50SZI17x54Rg0m')
---
    public function create()
    {
        // Inisialisasi model
        $model = new MemberModel();

        // Mengambil data JSON mentah dari body request
        $data = $this->request->getJSON();

        // Validasi input sederhana (Nama, email, password harus ada)
        if (!isset($data->nama) || !isset($data->email) || !isset($data->password)) {
            // Kirim respons error jika data tidak lengkap
            return $this->failResponse("Nama, email, dan password diperlukan", 400);
        }

        // **START: Tambahan Validasi Panjang Password**
        if (strlen($data->password) < 8) {
            return $this->failResponse("Password minimal 8 karakter", 400); // [cite: 335]
        }
        // **END: Tambahan Validasi Panjang Password**

        // Pengecekan duplikasi email
        if ($model->where('email', $data->email)->first()) {
            return $this->failResponse("Email sudah terdaftar", 400);
        }

        // Blok 'try...catch' untuk menangani error jika terjadi kegagalan saat insert DB
        try {
            // Memasukkan data ke database
            $model->insert([
                'nama' => $data->nama,
                'email' => $data->email,
                'password' => $data->password // Password mentah
                // Hashing akan otomatis ditangani oleh Model (callback beforeInsert)
            ]);